IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_pctrace_buffer_regs.xml
<module id="PCTRACE_BUFFER_REGS" HW_revision="" description="PCTRACE BUFFER Registers">
	<register id="PCTRACE_BUFFER_BASE" width="32" page="1" offset="0x0" internal="0" description="PCTRACE_BUFFER_BASE">
		<bitfield id="PROGRAM_COUNTER" description="Program Counter" begin="0" end="21" width="22" rwaccess="R"/>
		<bitfield id="BLOCKED" description="Access blocked due to security" begin="22" end="22" width="1" rwaccess="R"/>
	</register>
</module>
